ZCS{1,1}='富氧率';
ZCS{1,2}='透气性指数';
ZCS{1,3}='CO';
ZCS{1,4}='H2';
ZCS{1,5}='CO2';
ZCS{1,6}='标准风速';
ZCS{1,7}='富氧流量';
ZCS{1,8}='冷风流量';
ZCS{1,9}='鼓风动能';
ZCS{1,10}='炉腹煤气量';
ZCS{1,11}='炉腹煤气指数';
ZCS{1,12}='理论燃烧温度';
ZCS{1,13}='顶压';
ZCS{1,14}='顶压2';
ZCS{1,15}='顶压3';
ZCS{1,16}='富氧压力';
ZCS{1,17}='冷风压力';
ZCS{1,18}='全压差';
ZCS{1,19}='热风压力';
ZCS{1,20}='实际风速';
ZCS{1,21}='热风温度';
ZCS{1,22}='顶温东北';
ZCS{1,23}='顶温西南';
ZCS{1,24}='顶温西北';
ZCS{1,25}='顶温东南';
ZCS{1,26}='阻力系数';
ZCS{1,27}='鼓风湿度';
ZCS{1,28}='设定喷煤量';
ZCS{1,29}='本小时实际喷煤量';
ZCS{1,30}='上小时实际喷煤量';

ZCS{3,1}='富氧率';
ZCS{3,2}='透气性指数';
ZCS{3,3}='CO';
ZCS{3,4}='H2';
ZCS{3,5}='CO2';
ZCS{3,6}='标准风速';
ZCS{3,7}='富氧流量';
ZCS{3,8}='冷风流量';
ZCS{3,9}='鼓风动能';
ZCS{3,10}='炉腹煤气量';
ZCS{3,11}='炉腹煤气指数';
ZCS{3,12}='理论燃烧温度';
ZCS{3,13}='顶压';
ZCS{3,14}='顶压2';
ZCS{3,15}='富氧压力';
ZCS{3,16}='冷风压力';
ZCS{3,17}='全压差';
ZCS{3,18}='热风压力';
ZCS{3,19}='实际风速';
ZCS{3,20}='热风温度';
ZCS{3,21}='顶温东北';
ZCS{3,22}='顶温西南';
ZCS{3,23}='顶温西北';
ZCS{3,24}='顶温东南';
ZCS{3,25}='阻力系数';
ZCS{3,26}='鼓风湿度';
ZCS{3,27}='本小时实际喷煤量';
ZCS{3,28}='设定喷煤量';
ZCS{3,29}='上小时实际喷煤量';

ZCS{5,1}='富氧率';
ZCS{5,2}='透气性指数';
ZCS{5,3}='CO';
ZCS{5,4}='H2';
ZCS{5,5}='CO2';
ZCS{5,6}='标准风速';
ZCS{5,7}='富氧流量';
ZCS{5,8}='冷风流量';
ZCS{5,9}='鼓风动能';
ZCS{5,10}='炉腹煤气量';
ZCS{5,11}='炉腹煤气指数';
ZCS{5,12}='理论燃烧温度';
ZCS{5,13}='顶压';
ZCS{5,14}='顶压西北上';
ZCS{5,15}='富氧压力';
ZCS{5,16}='冷风压力';
ZCS{5,17}='全压差';
ZCS{5,18}='热风压力';
ZCS{5,19}='实际风速';
ZCS{5,20}='热风温度';
ZCS{5,21}='顶温东北';
ZCS{5,22}='顶温西南';
ZCS{5,23}='顶温西北';
ZCS{5,24}='顶温东南';
ZCS{5,25}='阻力系数';
ZCS{5,26}='鼓风湿度';
ZCS{5,27}='设定喷煤量';
ZCS{5,28}='上小时实际喷煤量';

ZCS{6,1}='富氧率';
ZCS{6,2}='透气性指数';
ZCS{6,3}='CO';
ZCS{6,4}='H2';
ZCS{6,5}='CO2';
ZCS{6,6}='标准风速';
ZCS{6,7}='富氧流量';
ZCS{6,8}='冷风流量';
ZCS{6,9}='鼓风动能';
ZCS{6,10}='炉腹煤气量';
ZCS{6,11}='炉腹煤气指数';
ZCS{6,12}='理论燃烧温度';
ZCS{6,13}='顶压';
ZCS{6,14}='顶压2';
ZCS{6,15}='富氧压力';
ZCS{6,16}='冷风压力';
ZCS{6,17}='全压差';
ZCS{6,18}='热风压力';
ZCS{6,19}='实际风速';
ZCS{6,20}='热风温度';
ZCS{6,21}='顶温东北';
ZCS{6,22}='顶温西南';
ZCS{6,23}='顶温西北';
ZCS{6,24}='顶温东南';
ZCS{6,25}='阻力系数';
ZCS{6,26}='鼓风湿度';
ZCS{6,27}='设定喷煤量';
ZCS{6,28}='上小时实际喷煤量';

ZCS{7,1}='富氧率';
ZCS{7,2}='透气性指数';
ZCS{7,3}='CO';
ZCS{7,4}='H2';
ZCS{7,5}='CO2';
ZCS{7,6}='标准风速';
ZCS{7,7}='富氧流量';
ZCS{7,8}='冷风流量';
ZCS{7,9}='鼓风动能';
ZCS{7,10}='炉腹煤气量';
ZCS{7,11}='炉腹煤气指数';
ZCS{7,12}='理论燃烧温度';
ZCS{7,13}='顶压';
ZCS{7,14}='顶压2';
ZCS{7,15}='顶压3';
ZCS{7,16}='顶压4' ;
ZCS{7,17}='富氧压力';
ZCS{7,18}='冷风压力';
ZCS{7,19}='冷风压力2';
ZCS{7,20}='全压差';
ZCS{7,21}='热风压力';
ZCS{7,22}='热风压力2';
ZCS{7,23}='实际风速';
ZCS{7,24}='冷风温度';
ZCS{7,25}='热风温度';
ZCS{7,26}='顶温东北';
ZCS{7,27}='顶温西南';
ZCS{7,28}='顶温西北';
ZCS{7,29}='顶温东南';
ZCS{7,30}='顶温下降管';
ZCS{7,31}='阻力系数';
ZCS{7,32}='鼓风湿度';
ZCS{7,33}='设定喷煤量';
ZCS{7,34}='本小时实际喷煤量';
ZCS{7,35}='上小时实际喷煤量';

% commenVar={'理论燃烧温度','透气性指数','炉腹煤气量','实际风速','标准风速','顶温东南','全压差','顶温西北','顶压','鼓风湿度','冷风流量','阻力系数','富氧流量','CO','设定喷煤量','冷风压力','富氧压力','炉腹煤气指数','热风压力','CO2','热风温度','H2','富氧率','顶温东北','上小时实际喷煤量','鼓风动能','顶温西南'}';
% 删除没有用的喷煤量
commenVar={'理论燃烧温度','透气性指数','炉腹煤气量','实际风速','标准风速','顶温东南','全压差','顶温西北','顶压','鼓风湿度','冷风流量','阻力系数','富氧流量','CO','冷风压力','富氧压力','炉腹煤气指数','热风压力','CO2','热风温度','H2','富氧率','顶温东北','鼓风动能','顶温西南'}';
commenDim=cell(0);
for i1=1:size(ZCS,1)
    index=[];
    for i2=1:size(ZCS,2)
        for i3=1:length(commenVar)
            if strcmp(ZCS{i1,i2},commenVar{i3})==1
                index=[index;i2];
                break;
            end
        end
    end
    commenDim{i1,1}=index;
end

%% 检验是否对齐
for i1=1:size(ZCS,1)
    name{i1,1}=ZCS(i1,commenDim{i1});
end
commenVar=name{1}';
clear i1 i2 i3 index name;
% flag=0;
% for i1=1:length(name{1})
%     varName=name{1};
%     for i2=[3,5,6,7]
%         if strcmp(name{i2}{i1},varName{i1})~=1
%             flag=1;
%         end
%     end
% end